#include "stdafx.h"
#include "ChatClient.h"
const std::wstring longUsername = LR"(一个幸存者正要将重机枪调转枪口，只见成才一滚，一脚将他的枪口踢得拧转了方向，另一脚踢在那人的腹部上，不想却整个儿被人扔了出来摔在墙上。许三多几个冲进来一看，不由暗暗惊讶，那幸存者根本就是个巨人，他一个人就几乎占满了整个地堡，他微微冷笑着，掏出一把样子可怖的丛林砍刀，挥舞着。许三多迅速晃出一把短刀，跟对手相比那简直是把水果刀，于是对手笑得更加开心，谁知，许三多的短刀却发出砰的一声枪响，那人不由得瞠目结舌，倒在了地上。
    这种能射击三发手枪子弹的短刀是中国士兵的特殊装备。sssfdafdddd一个幸存者正要将重机枪调转枪口，只见成才一滚，一脚将他的枪口踢得拧转了方向，另一脚踢在那人的腹部上，不想却整个儿被人扔了出来摔在墙上。许三多几个冲进来一看，不由暗暗惊讶，那幸存者根本就是个巨人，他一个人就几乎占满了整个地堡，他微微冷笑着，掏出一把样子可怖的丛林砍刀，挥舞着。许三多迅速晃出一把短刀，跟对手相比那简直是把水果刀，于是对手笑得更加开心，谁知，许三多的短刀却发出砰的一声枪响，那人不由得瞠目结舌，倒在了地上。
    这种能射击三发手枪子弹的短刀是中国士兵的特殊装备。sssfdafdddd一个幸存者正要将重机枪调转枪口，只见成才一滚，一脚将他的枪口踢得拧转了方向，另一脚踢在那人的腹部上，不想却整个儿被人扔了出来摔在墙上。许三多几个冲进来一看，不由暗暗惊讶，那幸存者根本就是个巨人，他一个人就几乎占满了整个地堡，他微微冷笑着，掏出一把样子可怖的丛林砍刀，挥舞着。许三多迅速晃出一把短刀，跟对手相比那简直是把水果刀，于是对手笑得更加开心，谁知，许三多的短刀却发出砰的一声枪响，那人不由得瞠目结舌，倒在了地上。
    这种能射击三发手枪子弹的短刀是中国士兵的特殊装备。sssfdafdddd一个幸存者正要将重机枪调转枪口，只见成才一滚，一脚将他的枪口踢得拧转了方向，另一脚踢在那人的腹部上，不想却整个儿被人扔了出来摔在墙上。许三多几个冲进来一看，不由暗暗惊讶，那幸存者根本就是个巨人，他一个人就几乎占满了整个地堡，他微微冷笑着，掏出一把样子可怖的丛林砍刀，挥舞着。许三多迅速晃出一把短刀，跟对手相比那简直是把水果刀，于是对手笑得更加开心，谁知，许三多的短刀却发出砰的一声枪响，那人不由得瞠目结舌，倒在了地上。
    这种能射击三发手枪子弹的短刀是中国士兵的特殊装备。sssfdafdddd一个幸存者正要将重机枪调转枪口，只见成才一滚，一脚将他的枪口踢得拧转了方向，另一脚踢在那人的腹部上，不想却整个儿被人扔了出来摔在墙上。许三多几个冲进来一看，不由暗暗惊讶，那幸存者根本就是个巨人，他一个人就几乎占满了整个地堡，他微微冷笑着，掏出一把样子可怖的丛林砍刀，挥舞着。许三多迅速晃出一把短刀，跟对手相比那简直是把水果刀，于是对手笑得更加开心，谁知，许三多的短刀却发出砰的一声枪响，那人不由得瞠目结舌，倒在了地上。
    这种能射击三发手枪子弹的短刀是中国士兵的特殊装备。sssfdafdddd一个幸存者正要将重机枪调转枪口，只见成才一滚，一脚将他的枪口踢得拧转了方向，另一脚踢在那人的腹部上，不想却整个儿被人扔了出来摔在墙上。许三多几个冲进来一看，不由暗暗惊讶，那幸存者根本就是个巨人，他一个人就几乎占满了整个地堡，他微微冷笑着，掏出一把样子可怖的丛林砍刀，挥舞着。许三多迅速晃出一把短刀，跟对手相比那简直是把水果刀，于是对手笑得更加开心，谁知，许三多的短刀却发出砰的一声枪响，那人不由得瞠目结舌，倒在了地上。
    这种能射击三发手枪子弹的短刀是中国士兵的特殊装备。sssfdafdddd一个幸存者正要将重机枪调转枪口，只见成才一滚，一脚将他的枪口踢得拧转了方向，另一脚踢在那人的腹部上，不想却整个儿被人扔了出来摔在墙上。许三多几个冲进来一看，不由暗暗惊讶，那幸存者根本就是个巨人，他一个人就几乎占满了整个地堡，他微微冷笑着，掏出一把样子可怖的丛林砍刀，挥舞着。许三多迅速晃出一把短刀，跟对手相比那简直是把水果刀，于是对手笑得更加开心，谁知，许三多的短刀却发出砰的一声枪响，那人不由得瞠目结舌，倒在了地上。
    这种能射击三发手枪子弹的短刀是中国士兵的特殊装备。sssfdafdddd一个幸存者正要将重机枪调转枪口，只见成才一滚，一脚将他的枪口踢得拧转了方向，另一脚踢在那人的腹部上，不想却整个儿被人扔了出来摔在墙上。许三多几个冲进来一看，不由暗暗惊讶，那幸存者根本就是个巨人，他一个人就几乎占满了整个地堡，他微微冷笑着，掏出一把样子可怖的丛林砍刀，挥舞着。许三多迅速晃出一把短刀，跟对手相比那简直是把水果刀，于是对手笑得更加开心，谁知，许三多的短刀却发出砰的一声枪响，那人不由得瞠目结舌，倒在了地上。
    这种能射击三发手枪子弹的短刀是中国士兵的特殊装备。sssfdafdddd一个幸存者正要将重机枪调转枪口，只见成才一滚，一脚将他的枪口踢得拧转了方向，另一脚踢在那人的腹部上，不想却整个儿被人扔了出来摔在墙上。许三多几个冲进来一看，不由暗暗惊讶，那幸存者根本就是个巨人，他一个人就几乎占满了整个地堡，他微微冷笑着，掏出一把样子可怖的丛林砍刀，挥舞着。许三多迅速晃出一把短刀，跟对手相比那简直是把水果刀，于是对手笑得更加开心，谁知，许三多的短刀却发出砰的一声枪响，那人不由得瞠目结舌，倒在了地上。
    这种能射击三发手枪子弹的短刀是中国士兵的特殊装备。sssfdafdddd一个幸存者正要将重机枪调转枪口，只见成才一滚，一脚将他的枪口踢得拧转了方向，另一脚踢在那人的腹部上，不想却整个儿被人扔了出来摔在墙上。许三多几个冲进来一看，不由暗暗惊讶，那幸存者根本就是个巨人，他一个人就几乎占满了整个地堡，他微微冷笑着，掏出一把样子可怖的丛林砍刀，挥舞着。许三多迅速晃出一把短刀，跟对手相比那简直是把水果刀，于是对手笑得更加开心，谁知，许三多的短刀却发出砰的一声枪响，那人不由得瞠目结舌，倒在了地上。
    这种能射击三发手枪子弹的短刀是中国士兵的特殊装备。sssfdafdddd一个幸存者正要将重机枪调转枪口，只见成才一滚，一脚将他的枪口踢得拧转了方向，另一脚踢在那人的腹部上，不想却整个儿被人扔了出来摔在墙上。许三多几个冲进来一看，不由暗暗惊讶，那幸存者根本就是个巨人，他一个人就几乎占满了整个地堡，他微微冷笑着，掏出一把样子可怖的丛林砍刀，挥舞着。许三多迅速晃出一把短刀，跟对手相比那简直是把水果刀，于是对手笑得更加开心，谁知，许三多的短刀却发出砰的一声枪响，那人不由得瞠目结舌，倒在了地上。
    这种能射击三发手枪子弹的短刀是中国士兵的特殊装备。sssfdafdddd一个幸存者正要将重机枪调转枪口，只见成才一滚，一脚将他的枪口踢得拧转了方向，另一脚踢在那人的腹部上，不想却整个儿被人扔了出来摔在墙上。许三多几个冲进来一看，不由暗暗惊讶，那幸存者根本就是个巨人，他一个人就几乎占满了整个地堡，他微微冷笑着，掏出一把样子可怖的丛林砍刀，挥舞着。许三多迅速晃出一把短刀，跟对手相比那简直是把水果刀，于是对手笑得更加开心，谁知，许三多的短刀却发出砰的一声枪响，那人不由得瞠目结舌，倒在了地上。
    这种能射击三发手枪子弹的短刀是中国士兵的特殊装备。sssfdafdddd一个幸存者正要将重机枪调转枪口，只见成才一滚，一脚将他的枪口踢得拧转了方向，另一脚踢在那人的腹部上，不想却整个儿被人扔了出来摔在墙上。许三多几个冲进来一看，不由暗暗惊讶，那幸存者根本就是个巨人，他一个人就几乎占满了整个地堡，他微微冷笑着，掏出一把样子可怖的丛林砍刀，挥舞着。许三多迅速晃出一把短刀，跟对手相比那简直是把水果刀，于是对手笑得更加开心，谁知，许三多的短刀却发出砰的一声枪响，那人不由得瞠目结舌，倒在了地上。
    这种能射击三发手枪子弹的短刀是中国士兵的特殊装备。sssfdafdddd一个幸存者正要将重机枪调转枪口，只见成才一滚，一脚将他的枪口踢得拧转了方向，另一脚踢在那人的腹部上，不想却整个儿被人扔了出来摔在墙上。许三多几个冲进来一看，不由暗暗惊讶，那幸存者根本就是个巨人，他一个人就几乎占满了整个地堡，他微微冷笑着，掏出一把样子可怖的丛林砍刀，挥舞着。许三多迅速晃出一把短刀，跟对手相比那简直是把水果刀，于是对手笑得更加开心，谁知，许三多的短刀却发出砰的一声枪响，那人不由得瞠目结舌，倒在了地上。
    这种能射击三发手枪子弹的短刀是中国士兵的特殊装备。sssfdafdddd一个幸存者正要将重机枪调转枪口，只见成才一滚，一脚将他的枪口踢得拧转了方向，另一脚踢在那人的腹部上，不想却整个儿被人扔了出来摔在墙上。许三多几个冲进来一看，不由暗暗惊讶，那幸存者根本就是个巨人，他一个人就几乎占满了整个地堡，他微微冷笑着，掏出一把样子可怖的丛林砍刀，挥舞着。许三多迅速晃出一把短刀，跟对手相比那简直是把水果刀，于是对手笑得更加开心，谁知，许三多的短刀却发出砰的一声枪响，那人不由得瞠目结舌，倒在了地上。
    这种能射击三发手枪子弹的短刀是中国士兵的特殊装备。sssfdafdddd一个幸存者正要将重机枪调转枪口，只见成才一滚，一脚将他的枪口踢得拧转了方向，另一脚踢在那人的腹部上，不想却整个儿被人扔了出来摔在墙上。许三多几个冲进来一看，不由暗暗惊讶，那幸存者根本就是个巨人，他一个人就几乎占满了整个地堡，他微微冷笑着，掏出一把样子可怖的丛林砍刀，挥舞着。许三多迅速晃出一把短刀，跟对手相比那简直是把水果刀，于是对手笑得更加开心，谁知，许三多的短刀却发出砰的一声枪响，那人不由得瞠目结舌，倒在了地上。
    这种能射击三发手枪子弹的短刀是中国士兵的特殊装备。sssfdafdddd)";

int _tmain(int argc, _TCHAR* argv[])
{
	WORD wVersionRequested;
	WSADATA wsaData;
	int err;
	int count = 10000;
	wVersionRequested = MAKEWORD(2, 2);
	err = WSAStartup(wVersionRequested, &wsaData);
	assert(err == 0);

	int port = std::stoi(argv[2]);
	std::vector<std::thread> threads;
	ChatClient* client = new ChatClient(L"127.0.0.1", 2333);

	for (int i = 0; i < 10; ++i) {
		threads.push_back(std::thread([] {
			for (int i = 0; i < 1024; ++i) {
				ChatClient* client = new ChatClient(L"127.0.0.1", 2333);
				client->loginIn(L"keke", L"haha");
			}
		}));
	}

	for (auto& thread : threads) {
		thread.join();
	}
	WSACleanup();
	return 0;
}